app/controllers/products_controller.rb

SELECT  `products`.* FROM `products`  ORDER BY id ASC LIMIT 20
---
  def index
    @products = Product.order("id ASC").limit(20)

SELECT `products`.* FROM `products` WHERE (title LIKE('% あ %'))
---
  def search
    @products = Product.where('title LIKE(?)',"%#{params[:keyword]}%")