app/views/products/show.html.erb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 1
---
                <li style="border-bottom: dotted 1px">
                <% @product.reviews.each do|review|%>